Documents/ЗапускБП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ЗапускБП</Name>
			<Comment>Трейд Софт</Comment>
			<BasedOn>
				<xr:Item>Document.ПринятиеВРаботуОрганизации</xr:Item>
				<xr:Item>Document.АктПередачи</xr:Item>
				<xr:Item>Document.ЗагрузкаЗадолженности</xr:Item>
				<xr:Item>Document.АктуализацияЗадолженности</xr:Item>
				<xr:Item>Document.ПоступлениеПлатежей</xr:Item>
				<xr:Item>Document.СкорингДолговыхОбязательств</xr:Item>
				<xr:Item>Document.ЗавершениеРаботыОрганизации</xr:Item>
				<xr:Item>Catalog.Контрагенты</xr:Item>
				<xr:Item>Catalog.ДоговорыКонтрагентов</xr:Item>
				<xr:Item>Catalog.УслугиПоДоговору</xr:Item>
				<xr:Item>Catalog.ДолговыеОбязательства</xr:Item>
				<xr:Item>Catalog.ИсполнительныеДокументы</xr:Item>
				<xr:Item>Document.ФормированиеПретензионногоПисьма</xr:Item>
				<xr:Item>Document.ЗаданияДляАвтоинформирования</xr:Item>
				<xr:Item>Document.ПередачаНаВыполнение</xr:Item>
				<xr:Item>Document.ПередатьДела</xr:Item>
				<xr:Item>Catalog.Залоги</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Операция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОперацииБП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Схема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КартыМаршрутов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТССтартоватьСВыбраннойСтадии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочкаСтарта</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТСПуть</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТСМероприятие</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПровестиВФоновомРежиме</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Объекты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Объект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
								<v8:Type>cfg:CatalogRef.УслугиПоДоговору</v8:Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:Type>cfg:CatalogRef.Залоги</v8:Type>
								<v8:Type>cfg:CatalogRef.ИсполнительныеДокументы</v8:Type>
								<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/ДолговыеОбязательства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ДолговыеОбязательства</Name>
			<Comment>Трейд Софт</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВалютаДоговора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДолговогоОбязательства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыДолговыхОбязательств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кредитор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УслугиПоДоговору</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецДоговор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецДолжник</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецКонтрагент</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецКредитор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецУслуга</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодДО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретАвтообзвона</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеконтактныеНомера</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Контрагенты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидКонтрагента</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УслугиПоДоговору</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/ЗапускБП/Ext/ManagerModule.bsl
Процедура ОбработкаПроведенияОбщая(Отказ, Проведение, ЭтотОбъект) Экспорт	
	
	ОбработкаПроведения(Отказ, Проведение, ЭтотОбъект);
	СнятьПометкуУдаления(Отказ, Проведение, ЭтотОбъект);
	
КонецПроцедуры

// Восстановление помеченных на удаление
Процедура СнятьПометкуУдаления(Отказ, Проведение, ЭтотОбъект) 
	Если ЭтотОбъект.Схема.Пустая() Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|			БизнесПроцессы.Ссылка КАК Ссылка,
	|			БизнесПроцессы.Объект КАК Объект,
	|			БизнесПроцессы.ПометкаУдаления КАК ПометкаУдаления
	|		ИЗ
	|			БизнесПроцесс.БизнесПроцессы КАК БизнесПроцессы
	|		ГДЕ
	|			БизнесПроцессы.Автор = &Ссылка И ПометкаУдаления = Истина");
	Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
	Результат = Запрос.Выполнить().Выбрать();
	
	Пока Результат.Следующий() Цикл
		// При проведении документа необходимо убирать пометку удаления 
		// у существующего документа "БизнесПроцессы" если она есть.
		// INFO нужна в случае распроведения и повторного проведения документа, так как бп помечаются на удаление
		Результат.Ссылка.ПолучитьОбъект().УстановитьПометкуУдаления(Ложь); 	
	КонецЦикла;	
КонецПроцедуры

// Восстановление удаленных и создание новых
Процедура ОбработкаПроведения(Отказ, Проведение, ЭтотОбъект) 
	Если ЭтотОбъект.Схема.Пустая() Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |ТЗ.Объект КАК Объект
	                      |ПОМЕСТИТЬ ТаблицаЗапускБП
	                      |ИЗ
	                      |&ТЗ КАК ТЗ
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Объект
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	БизнесПроцессы.Ссылка КАК Ссылка,
	                      |	БизнесПроцессы.Объект КАК Объект,
	                      |	БизнесПроцессы.ПометкаУдаления КАК ПометкаУдаления
	                      |ПОМЕСТИТЬ ТаблицаБП
	                      |ИЗ
	                      |	БизнесПроцесс.БизнесПроцессы КАК БизнесПроцессы
	                      |ГДЕ
	                      |	БизнесПроцессы.Автор = &Ссылка
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Объект
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ЕСТЬNULL(ТаблицаБП.Объект, ЗНАЧЕНИЕ(Справочник.ДолговыеОбязательства.ПустаяСсылка)) КАК Объект,
	                      |	ТаблицаЗапускБП.Объект КАК Объект1
	                      |ПОМЕСТИТЬ БПиЗБП
	                      |ИЗ
	                      |	ТаблицаЗапускБП КАК ТаблицаЗапускБП
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаБП КАК ТаблицаБП
	                      |		ПО (ТаблицаБП.Объект = ТаблицаЗапускБП.Объект)
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	БПиЗБП.Объект КАК ОбъектБП,
	                      |	БПиЗБП.Объект1 КАК ОбъектЗП
	                      |ИЗ
	                      |	БПиЗБП КАК БПиЗБП
	                      |ГДЕ
	                      |	БПиЗБП.Объект = ЗНАЧЕНИЕ(Справочник.ДолговыеОбязательства.ПустаяСсылка)");
	
	Запрос.УстановитьПараметр ("ТЗ", ЭтотОбъект.Объекты);
	Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
	Результат = Запрос.Выполнить().Выбрать();
	МассивДанных = ЭтотОбъект.ТочкаСтарта.Получить();
	Пока Результат.Следующий() Цикл
		Если Результат.ОбъектБП = Справочники.ДолговыеОбязательства.ПустаяСсылка() Тогда
			НовыйБП = БизнесПроцессы.БизнесПроцессы.СоздатьБизнесПроцесс();
			НовыйБП.Дата = ТекущаяДатаСеанса();
			НовыйБП.Организация = ЭтотОбъект.Организация;
			НовыйБП.Подразделение = ЭтотОбъект.Подразделение;
			НовыйБП.Схема = ЭтотОбъект.Схема;
			НовыйБП.Операция = ЭтотОбъект.Операция;
			НовыйБП.Автор = ЭтотОбъект.Ссылка;
			НовыйБП.Комментарий = "Документ ""Запуск БП""";
			НовыйБП.Объект = Результат.ОбъектЗП;
			НовыйБП.БПРодитель = ЭтотОбъект.Ссылка;
			
			Попытка
				НовыйБП.Записать();
			Исключение
				Отказ = Истина;
				Возврат;
			КонецПопытки;
			
			Если Не ЭтотОбъект.ТССтартоватьСВыбраннойСтадии Тогда
				НовыйБП.ЗапуститьБизнесПроцесс(Отказ);
			Иначе
				НовыйБП.ЗапуститьБизнесПроцессСТочки(Отказ, МассивДанных.ТСТочка, МассивДанных.ТСОбъектРодитель, МассивДанных.ТССхема, 
				МассивДанных.ТСТипМероприятия, МассивДанных.ТСМассив, МассивДанных.ТСИсполнитель);
			КонецЕсли;
			
			Если Отказ Тогда
				Возврат;
			КонецЕсли;	
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ, ЭтотОбъект) Экспорт
	
	// Запрос проверяет, созданы ли БизнесПроцессы для каждого ДО, которые есть в табличной части документа "ЗапускБП".
	// Полное соед. даёт возможность отследить:
	// 1) какие БизнесПроцессы были удалены для ДО, а в документе "ЗапускБП" они есть,
	// 2) какие строки ДО из ТЧ "ЗапускБП" были удалены, а БизнесПроцессы не удалены.
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|			БизнесПроцессы.Ссылка КАК БПСсылка,
	|			БизнесПроцессы.Объект КАК Объект,
	|			БизнесПроцессы.ПометкаУдаления КАК ПометкаУдаления
	|		ИЗ
	|			БизнесПроцесс.БизнесПроцессы КАК БизнесПроцессы
	|		ГДЕ
	|			БизнесПроцессы.Автор = &Ссылка И ПометкаУдаления = Ложь");
	
	Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
	Результат = Запрос.Выполнить().Выбрать();
	Пока Результат.Следующий() Цикл
		// Если Результат.Объект = Null, значит строка из ТЧ документа "ЗапускБП"" была удалена или
		// Если Результат.БПСсылка = Null, значит документ "БизнесПроцессы" был удален, т.е выполнять
		// выполнять отмену проведения у документа "БизнесПроцессы" не требуется.
		Результат.БПСсылка.ПолучитьОбъект().УстановитьПометкуУдаления(Истина);
	КонецЦикла;
КонецПроцедуры
